app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R') ORDER BY title
---
  def index
    @all_ratings = Movie.all_ratings
    if params[:ratings]
      @ratings = params[:ratings].keys
    end
    @movies = Movie.order(params[:sort_param]).find_all_by_rating(@ratings)